[
  {
    "id": "ashby",
    "enabled": true,
    "lang": "english",
    "company": "Ashby",
    "position": "Senior Software Engineer, Product Engineering",
    "hiringManager": "Abhik",
    "companyLogo": "/ashbyhq_logo.jpeg",
    "chatBubble": {
      "background": "#5453E6",
      "foreground": "#FFFFFF"
    },
    "hasCoverLetter": true,
    "defaultQuestions": [
      "Why Ashby?",
      "Tell me about 'baito' and its architecture",
      "How do you handle product ambiguity?",
      "What is your experience with TypeScript?"
    ],
    "description": "Senior Software Engineer, Product Engineering, EU\n\nDetails zum Jobangebot\nHi 👋🏾 I’m Abhik, Ashby's Co-Founder and VP of Engineering. We’re looking for an ambitious full-stack engineer who is laser-focused on solving customer problems and making the right long-term investments to solve them not only today but in our future features and products.\n\nWhat Ashby gives you in return is the best of both early and growth-stage environments. The agency and no-nonsense of a seed startup: you write product specs, make product and design decisions, and build in an almost-no-meeting culture. While also the product-market fit and scale of a growth-stage startup: tens of thousands of daily users who depend on your software and eagerly await your next feature.\n\nWe have notable customers like Notion, Linear, Shopify, and Snowflake. Our growth and retention metrics are best-in-class among our peers: we have tens of millions in ARR, growing >100% year over year, very low churn, and many years of runway. We’ll share more details once we meet.\n\nAbout The Role And How We Work\n\nOur engineering culture strives to recreate the environments where we did our best work as ICs – where we had the ownership and agency to impact our users with creative and innovative software.\n\nI started my career building software for artists in the Visual Effects industry. It was a formative experience for me as a software engineer because success relied on my ability to be a product manager and designer. I talked to artists to understand their needs. I came up with ideas. I did industry research, designed interfaces, and prototyped ideas. I watched artists use what I built and decided what to tackle in the next iteration. No daily stand-ups, no t-shirt sizing, no planning meetings.\n\nAbout\n\nAt Ashby, we’re building an environment that is optimistic about what engineers can own and achieve. An environment that embraces innovative engineers, and, frankly, often stays out of their way. As a Product Engineer, you’ll take ownership over a large portion of one of our products and own projects end-to-end (wearing hats traditionally worn by product and design). You’ll research competitors, write product specs, make wireframes, and more.\n\nTechnology Stack\n\nTypeScript (frontend & backend), React, GraphQL API, Node.js, Postgres, Redis."
  },
  {
    "id": "citylab",
    "enabled": true,
    "lang": "german",
    "company": "CityLAB Berlin",
    "position": "Full-Stack KI-Entwickler*in",
    "hiringManager": "Hiring Manager",
    "companyLogo": "/citylab_logo.jpg",
    "chatBubble": {
      "background": "#F64C72",
      "foreground": "#FFFFFF"
    },
    "hasCoverLetter": true,
    "defaultQuestions": [
      "Welche Erfahrung hast du mit KI/LLMs?",
      "Erzähl mir von deinen Full-Stack Projekten",
      "Wie passt du zum öffentlichen Sektor?",
      "Zeig mir deine Projekte"
    ],
    "description": "Das CityLAB ist Berlins öffentliches Innovationslabor. Gemeinsam mit der Berliner Verwaltung und zahlreichen Partnerorganisationen aus Wissenschaft und Stadtgesellschaft entwickeln wir Innovationsprojekte und digitale Prototypen wie Gieß den Kiez oder Parla, um die Zukunft des urbanen Lebens zu gestalten. Das CityLAB vereint Elemente aus Digitalwerkstatt, Service Design und interaktiver Ausstellung zu einem Ort, an dem Innovation und Partizipation zusammengedacht werden. Das CityLAB wird betrieben durch die gemeinnützige Technologiestiftung Berlin und gefördert durch die Berliner Senatskanzlei.\n\nUnser Team: Du bist Teil unseres Prototyping-Teams und begleitest neue Produkte von der Konzeption bis zum Release. Die Stelle ist zum 01.02.2026 in Vollzeit oder Teilzeit (mindestens 32 Stunden pro Woche) zu besetzen.\n\nAufgaben:\n- Du konzipierst und entwickelst eigenständig Web-Anwendungen und digitale Tools, die den Stand der Technik widerspiegeln.\n- Du setzt moderne Webtechnologien wie TypeScript, React, Node.js, Supabase, PostgreSQL und Docker ein, um innovative Prototypen zu realisieren.\n- Du entwickelst APIs, Server-Architekturen und intelligente KI-Agenten, die skalierbar und zukunftsfähig sind.\n- Du nutzt eigenverantwortlich KI-Frameworks wie PyTorch oder TensorFlow, um leistungsfähige Modelle zu implementieren.\n- Du entwickelst und optimierst Machine-Learning-Methoden mit Schwerpunkt auf Large Language Models (LLMs).\n- Du baust robuste Datenpipelines auf und stellst sicher, dass alle KI-Anwendungen datenschutzkonform betrieben werden.\n- Du begleitest die Einführung von KI-Technologien und Prozessautomatisierung in der öffentlichen Verwaltung.\n- Du führst interaktive Workshops, Ideation-Sessions und praxisorientierte Schulungen durch, um Wissen nachhaltig zu verankern.\n- Du präsentierst Projektergebnisse verständlich und überzeugend gegenüber Verwaltung und Stadtgesellschaft.\n- Du analysierst neue KI-Methoden und bewertest ihre Eignung für den Einsatz im öffentlichen Sektor.\n- Du identifizierst innovative Anwendungsmöglichkeiten für Bürger:innenservices und Verwaltungsprozesse und bringst sie in die Praxis.\n\nAnforderungen:\n- Du bringst mindestens zwei Jahre Berufserfahrung in der Entwicklung von KI-gestützten digitalen Anwendungen mit.\n- Du verfügst über ein abgeschlossenes Studium in Informatik, Data Science, Machine Learning, Interface Design o. Ä.\n- Du hast praktische Erfahrung mit KI-Technologien (z. B. LLMs, NLP, MCP, Agents, Machine Learning, Vektordatenbanken, Prompt Engineering, Fine-Tuning).\n- Du denkst kreativ und hast Freude daran, technische Lösungen in reale Verwaltungs- und Stadtanwendungsfälle zu übertragen.\n- Du arbeitest eigenständig, strukturiert und kommunizierst klar mit unterschiedlichen Stakeholder:innen.\n- Du verfügst über Deutschkenntnisse in Wort und Schrift (mindestens C1-Niveau).\n- Du identifizierst dich mit offenen Technologien (Open Source / Open Data) und möchtest gemeinwohlorientierte digitale Innovation in Berlin vorantreiben.\n- Du arbeitest routiniert mit agilen Methoden und verfolgst aktuelle Trends in KI, Webtechnologien und Design."
  },
  {
    "id": "fixmycity",
    "enabled": false,
    "lang": "german",
    "company": "FixMyCity GmbH",
    "position": "Full-Stack Entwickler:in",
    "hiringManager": "Hiring Manager",
    "companyLogo": "/fixmycity-logo.png",
    "chatBubble": {
      "background": "#fabe28",
      "foreground": "#000000"
    },
    "hasCoverLetter": true,
    "defaultQuestions": [
      "Welche Erfahrung hast du mit Next.js und TypeScript?",
      "Erzähl mir von deinen Projekten mit Geodaten",
      "Wie nutzt du AI-Tools beim Programmieren?",
      "Zeig mir deine Open-Source Projekte"
    ],
    "description": "FixMyCity entwickelt digitale Werkzeuge für die nachhaltige Mobilitätsplanung. Wir unterstützen Städte und Kommunen auf dem Weg zur nachhaltigen Mobilität mit Tools wie TILDA und Trassenscout.\n\nZur Verstärkung unseres Dev-Teams suchen wir eine:n Entwickler:in für 32 Stunden/Woche.\n\nWas du mitbringst:\n- Du hast Lust auf die Themen Verkehrswende, Geodaten und digitale Beteiligungsformate.\n- Du hast Erfahrung und Spaß an Webentwicklung mit TypeScript und Next.js.\n- Du verwendest Next.js als Fullstack-Framework (Server Components) und findest dich auf dem Server-Terminal sowie mit Docker zurecht.\n- Du hast bereits Erfahrung mit der Verarbeitung von Geodaten, idealerweise OpenStreetMap, oder Interesse an diesem Themenbereich.\n- Du kennst die Chancen und Limitationen von Copilot und Co. und hast diese Werkzeuge in deinen Programmier-Alltag integriert.\n- Dir liegt es, dich in Nutzer:innen von Software einzufühlen und Lösungsansätze aus deren Perspektive zu entwickeln.\n- Du organisierst deine Arbeit eigenverantwortlich, strukturiert und hast Freude an hochwertigem Code.\n- Du beteiligst dich an einer offenen und wertschätzenden Teamkultur.\n- Du arbeitest sicher und fließend auf Deutsch in Wort und Schrift.\n- Idealerweise wohnst du in Berlin.\n\nDeine Aufgaben:\n- Du bist Teil unseres agilen Teams und entwickelst mit uns unsere beiden Open-Source-Produkte Trassenscout und TILDA Geo weiter.\n\nWas dich erwartet:\n- Du wirkst an Open-Source- und Open-Data-Projekten mit gesellschaftlichem Impact mit.\n- Ein kleines, dynamisches Team mit modernem Software Stack.\n- Du arbeitest in engem Austausch mit erfahrenen Projektleiter:innen, Entwickler:innen sowie UX-Designer:innen.\n- Du triffst auf agile, selbstverantwortliche Arbeitsprozesse.\n- Software-Stack: TypeScript, React und Next.js, Astro, Tailwind CSS, MapLibre, React Map GL, Vercel AI SDK, Prisma, PostgreSQL, PostGIS, IONOS, Docker, GitHub.\n\nInfos / Konditionen:\n- Beginn ab März 2026, unbefristet\n- Gehalt angelehnt an TV-L E13, Stufe je nach Erfahrung\n- Arbeitszeit: 32 Stunden / Woche\n- Arbeitsort: thinkfarm in Tempelhof und Home Office nach Vereinbarung\n- Bewerbung bis zum 7.12.2025"
  }
]
