[
  {
    "id": "citylab",
    "company": "CityLAB Berlin",
    "position": "AI/Full-Stack Entwickler",
    "hiringManager": "Hiring Manager",
    "companyLogo": "/citylab_logo.jpg",
    "chatBubble": {
      "background": "#F64C72",
      "foreground": "#FFFFFF"
    },
    "defaultQuestions": [
      "Welche Erfahrung hast du mit KI/LLMs?",
      "Erzähl mir von deinen Full-Stack Projekten",
      "Wie passt du zum öffentlichen Sektor?",
      "Zeig mir deine Projekte"
    ],
    "description": "Das CityLAB ist Berlins öffentliches Innovationslabor. Gemeinsam mit der Berliner Verwaltung und zahlreichen Partnerorganisationen aus Wissenschaft und Stadtgesellschaft entwickeln wir Innovationsprojekte und digitale Prototypen wie Gieß den Kiez oder Parla, um die Zukunft des urbanen Lebens zu gestalten. Das CityLAB vereint Elemente aus Digitalwerkstatt, Service Design und interaktiver Ausstellung zu einem Ort, an dem Innovation und Partizipation zusammengedacht werden. Das CityLAB wird betrieben durch die gemeinnützige Technologiestiftung Berlin und gefördert durch die Berliner Senatskanzlei.\n\nUnser Team: Du bist Teil unseres Prototyping-Teams und begleitest neue Produkte von der Konzeption bis zum Release. Die Stelle ist zum 01.02.2026 in Vollzeit oder Teilzeit (mindestens 32 Stunden pro Woche) zu besetzen.\n\nAufgaben:\n- Du konzipierst und entwickelst eigenständig Web-Anwendungen und digitale Tools, die den Stand der Technik widerspiegeln.\n- Du setzt moderne Webtechnologien wie TypeScript, React, Node.js, Supabase, PostgreSQL und Docker ein, um innovative Prototypen zu realisieren.\n- Du entwickelst APIs, Server-Architekturen und intelligente KI-Agenten, die skalierbar und zukunftsfähig sind.\n- Du nutzt eigenverantwortlich KI-Frameworks wie PyTorch oder TensorFlow, um leistungsfähige Modelle zu implementieren.\n- Du entwickelst und optimierst Machine-Learning-Methoden mit Schwerpunkt auf Large Language Models (LLMs).\n- Du baust robuste Datenpipelines auf und stellst sicher, dass alle KI-Anwendungen datenschutzkonform betrieben werden.\n- Du begleitest die Einführung von KI-Technologien und Prozessautomatisierung in der öffentlichen Verwaltung.\n- Du führst interaktive Workshops, Ideation-Sessions und praxisorientierte Schulungen durch, um Wissen nachhaltig zu verankern.\n- Du präsentierst Projektergebnisse verständlich und überzeugend gegenüber Verwaltung und Stadtgesellschaft.\n- Du analysierst neue KI-Methoden und bewertest ihre Eignung für den Einsatz im öffentlichen Sektor.\n- Du identifizierst innovative Anwendungsmöglichkeiten für Bürger:innenservices und Verwaltungsprozesse und bringst sie in die Praxis.\n\nAnforderungen:\n- Du bringst mindestens zwei Jahre Berufserfahrung in der Entwicklung von KI-gestützten digitalen Anwendungen mit.\n- Du verfügst über ein abgeschlossenes Studium in Informatik, Data Science, Machine Learning, Interface Design o. Ä.\n- Du hast praktische Erfahrung mit KI-Technologien (z. B. LLMs, NLP, MCP, Agents, Machine Learning, Vektordatenbanken, Prompt Engineering, Fine-Tuning).\n- Du denkst kreativ und hast Freude daran, technische Lösungen in reale Verwaltungs- und Stadtanwendungsfälle zu übertragen.\n- Du arbeitest eigenständig, strukturiert und kommunizierst klar mit unterschiedlichen Stakeholder:innen.\n- Du verfügst über Deutschkenntnisse in Wort und Schrift (mindestens C1-Niveau).\n- Du identifizierst dich mit offenen Technologien (Open Source / Open Data) und möchtest gemeinwohlorientierte digitale Innovation in Berlin vorantreiben.\n- Du arbeitest routiniert mit agilen Methoden und verfolgst aktuelle Trends in KI, Webtechnologien und Design."
  }
]

